* Initialization
#+NAME: py_definitions
#+begin_src python :python python3
import requests

def search_wikipedia(searchterm, limit, namespace = 0):
    url = f"https://en.wikipedia.org/w/api.php"
    params = {
        'action': 'opensearch',
        'search': searchterm,
        'limit': limit,
        'namespace': namespace,
        'format': 'json'
    }
    term, titles, descriptions, links = requests.get(url = url, params = params).json()
    return list(zip(titles, descriptions, links))
#+end_src

#+RESULTS: py_definitions
: None

* Promises
** Searching Wikipedia

#+begin_src python :python python3 :noweb yes
<<py_definitions>>
result = search_wikipedia('Bauer', 2)
return(result)
#+end_src

#+RESULTS:
| Bauer       | Bauer may refer to:                                                | https://en.wikipedia.org/wiki/Bauer       |
| Bauer Radio | Bauer Radio is a UK-based radio division of the Bauer Media Group. | https://en.wikipedia.org/wiki/Bauer_Radio |

** Searching multiple namespaces
#+begin_src python :python python3 :noweb yes
<<py_definitions>>
results = []
for ns in [0, 1, 2, 3]:
    results.extend(search_wikipedia('Bauer', 10, ns))

return(results)
#+end_src

#+RESULTS:
| Bauer                                | Bauer may refer to:                                                                                                                                                                                                                                                                                                                      | https://en.wikipedia.org/wiki/Bauer                                |
| Bauer Radio                          | Bauer Radio is a UK-based radio division of the Bauer Media Group.                                                                                                                                                                                                                                                                       | https://en.wikipedia.org/wiki/Bauer_Radio                          |
| Bauer Media Group                    | Bauer Media Group (formerly Bauer Verlagsgruppe) is a German multimedia conglomerate headquartered in Hamburg that manages a portfolio of more than 600 magazines, over 400 digital products and 50 radio and TV stations around the world.                                                                                              | https://en.wikipedia.org/wiki/Bauer_Media_Group                    |
| Bauer College of Business            | The C.T. Bauer College of Business is the business school of the University of Houston, and is fully accredited by the AACSB International.                                                                                                                                                                                              | https://en.wikipedia.org/wiki/Bauer_College_of_Business            |
| Bauernschnapsen                      | The card game of Bauernschnapsen (also called Viererschnapsen) is an expanded form of the popular Austrian card game of Schnapsen, played by four players.                                                                                                                                                                               | https://en.wikipedia.org/wiki/Bauernschnapsen                      |
| Bauer Hockey                         | Bauer Hockey (renamed Nike Bauer from 2005 to 2008) is a manufacturer of ice hockey equipment, fitness and recreational skates and apparel.                                                                                                                                                                                              | https://en.wikipedia.org/wiki/Bauer_Hockey                         |
| Bauer (surname)                      | Bauer is a German surname meaning "peasant" or "farmer".                                                                                                                                                                                                                                                                                 | https://en.wikipedia.org/wiki/Bauer_(surname)                      |
| Bauerfield International Airport     | Bauerfield International Airport (IATA: VLI, ICAO: NVVV) is an airport located in Port Vila, Vanuatu. The airport is relatively small in size, but its runway has the capability and length to accept jets up to the Airbus A330. It serves as the hub for Vanuatu's flag carrier airline, Air Vanuatu.                                  | https://en.wikipedia.org/wiki/Bauerfield_International_Airport     |
| Bauer AG                             | BAUER Aktiengesellschaft is a stock-market-listed construction and machinery manufacturing concern based in Schrobenhausen in Upper Bavaria, Germany.                                                                                                                                                                                    | https://en.wikipedia.org/wiki/Bauer_AG                             |
| Bauerchen                            | Bauerchen, also Bauerchens, Bauersche or Bauersches, is a trick-taking card game of the Ace-Ten family that is played in the Palatinate region of Germany, especially around the city of Kaiserslautern.                                                                                                                                 | https://en.wikipedia.org/wiki/Bauerchen                            |
| Talk:Bauer                           |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer                           |
| Talk:Bauer family (Guiding Light)    |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer_family_(Guiding_Light)    |
| Talk:Bauer Media Group               |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer_Media_Group               |
| Talk:Bauer Media Group/Archives/2014 |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer_Media_Group/Archives/2014 |
| Talk:Bauer Radio                     |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer_Radio                     |
| Talk:Bauer Media Group/Archives/2016 |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer_Media_Group/Archives/2016 |
| Talk:Bauer Media Group/Archives/2015 |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer_Media_Group/Archives/2015 |
| Talk:Bauer (play)                    |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer_(play)                    |
| Talk:Bauer Media Group/Archives/2013 |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer_Media_Group/Archives/2013 |
| Talk:Bauer-Nilsen                    |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Talk:Bauer-Nilsen                    |
| User:BauerPower                      |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User:BauerPower                      |
| User:Bauerkn                         |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User:Bauerkn                         |
| User:Bauermen                        |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User:Bauermen                        |
| User:BauerFanatic87                  | Charmed, especially Prue Halliwell vandal.                                                                                                                                                                                                                                                                                               | https://en.wikipedia.org/wiki/User:BauerFanatic87                  |
| User:Baueram                         | Senior pre-med and Spanish student at University of Wisconsin Eau Claire.                                                                                                                                                                                                                                                                | https://en.wikipedia.org/wiki/User:Baueram                         |
| User:Bauer747/sandbox                |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User:Bauer747/sandbox                |
| User:Bauerman24                      | This is the page for Bauerman24. I didn't want my name to have a red link, so I put this page here to make that disappear.                                                                                                                                                                                                               | https://en.wikipedia.org/wiki/User:Bauerman24                      |
| User:Bauer747                        |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User:Bauer747                        |
| User:Bauerf                          | Ulluco (Ullucus tuberosus) is a plant grown primarily as a root vegetable, secondarily as a leaf vegetable.                                                                                                                                                                                                                              | https://en.wikipedia.org/wiki/User:Bauerf                          |
| User:Bauerkn/sandbox                 |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User:Bauerkn/sandbox                 |
| User talk:Bauer-3                    |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User_talk:Bauer-3                    |
| User talk:Bauermill                  | The article Rush Campbell has been speedily deleted from Wikipedia. This was done because the article seemed to be about a real person, organization (band, club, company, etc.), or web content, but it did not indicate how or why the subject is notable, that is, why an article about that subject should be included in Wikipedia. | https://en.wikipedia.org/wiki/User_talk:Bauermill                  |
| User talk:Bauermen                   | hi                                                                                                                                                                                                                                                                                                                                       | https://en.wikipedia.org/wiki/User_talk:Bauermen                   |
| User talk:Bauerhoc9                  |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User_talk:Bauerhoc9                  |
| User talk:BauerPower                 |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User_talk:BauerPower                 |
| User talk:Bauerkn                    |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User_talk:Bauerkn                    |
| User talk:Bauerf                     | Dear users!                                                                                                                                                                                                                                                                                                                              | https://en.wikipedia.org/wiki/User_talk:Bauerf                     |
| User talk:Bauer24rox                 |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User_talk:Bauer24rox                 |
| User talk:Bauerb                     |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User_talk:Bauerb                     |
| User talk:BauerBaby                  |                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User_talk:BauerBaby                  |

** Let's do it asynchronously!

#+begin_src python :python python3 :noweb yes
<<py_definitions>>
import concurrent.futures as futures

def search_async(term, limit, namespaces = [0]):
    executor = futures.ThreadPoolExecutor(max_workers=len(namespaces))
    fs = [executor.submit(search_wikipedia, term, limit, ns) for ns in namespaces]
    done, not_done = futures.wait(fs)
    assert(len(not_done) == 0)
    results = []
    for f in done:
        results.extend(f.result())
    return results

result = search_async('Hanz', 5, [0, 1, 2, 3])
return(result)
#+end_src

#+RESULTS:
| Talk:Hanze University of Applied Sciences | This school is not a university according to the Dutch law, but an HBO (higher professional school), so I removed the category link.                                                                                                                                                                                                                                                                                                                   | https://en.wikipedia.org/wiki/Talk:Hanze_University_of_Applied_Sciences |
| Talk:Hanzo (Overwatch)/GA1                |                                                                                                                                                                                                                                                                                                                                                                                                                                                        | https://en.wikipedia.org/wiki/Talk:Hanzo_(Overwatch)/GA1                |
| Talk:Hanzo (Overwatch)                    |                                                                                                                                                                                                                                                                                                                                                                                                                                                        | https://en.wikipedia.org/wiki/Talk:Hanzo_(Overwatch)                    |
| Talk:Hanzel Martínez                      |                                                                                                                                                                                                                                                                                                                                                                                                                                                        | https://en.wikipedia.org/wiki/Talk:Hanzel_Mart%C3%ADnez                 |
| Talk:Hanzel und Gretyl                    | =                                                                                                                                                                                                                                                                                                                                                                                                                                                      | https://en.wikipedia.org/wiki/Talk:Hanzel_und_Gretyl                    |
| Hans Zimmer                               | Hans Florian Zimmer (German pronunciation: [ˈhans ˈfloːʁi̯aːn ˈtsɪmɐ] (listen); born 12 September 1957) is a German film score composer and record producer.                                                                                                                                                                                                                                                                                            | https://en.wikipedia.org/wiki/Hans_Zimmer                               |
| Hansel and Gretel                         | "Hansel and Gretel" (; also known as "Hansel and Grettel", "Hansel and Grethel", or "Little Brother and Little Sister"; German: Hänsel und Gret(h)el [ˈhɛnzl̩ ʔʊnt ˈɡʁeːtl̩]) is a well-known German fairy tale recorded by the Brothers Grimm and published in 1812. Hansel and Gretel are a young brother and sister kidnapped by a cannibalistic witch living in a forest in a house constructed of cake, confectionery, candy, and many more treats. | https://en.wikipedia.org/wiki/Hansel_and_Gretel                         |
| Han unification                           | Han unification is an effort by the authors of Unicode and the Universal Character Set to map multiple character sets of the so-called CJK languages into a single set of unified characters.                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/Han_unification                           |
| Hanzhong                                  | Hanzhong (Chinese: 汉中; literally: 'middle of the Han (River)') is a prefecture-level city in the southwest of Shaanxi province, China, bordering the provinces of Sichuan to the south and Gansu to the west.                                                                                                                                                                                                                                        | https://en.wikipedia.org/wiki/Hanzhong                                  |
| Hanzo (Overwatch)                         | Hanzo Shimada (Japanese: 島田半蔵, Hepburn: シマダ・ハンゾー, Shimada Hanzō) is a playable character appearing in the 2016 video game Overwatch, a  first-person shooter video game  developed by Blizzard Entertainment.                                                                                                                                                                                                                              | https://en.wikipedia.org/wiki/Hanzo_(Overwatch)                         |
| User:HanzoHattori                         | User:NiemtiThis page is a soft redirect.                                                                                                                                                                                                                                                                                                                                                                                                               | https://en.wikipedia.org/wiki/User:HanzoHattori                         |
| User:Hanzov69                             |                                                                                                                                                                                                                                                                                                                                                                                                                                                        | https://en.wikipedia.org/wiki/User:Hanzov69                             |
| User:Hanzolot                             | Sooner or later, I'll actually make this page up (maybe)... but until then:                                                                                                                                                                                                                                                                                                                                                                            | https://en.wikipedia.org/wiki/User:Hanzolot                             |
| User:Hanz24                               | Hello I'm hanz24 history enthusiast  and also have knowledge in other history topics as well                                                                                                                                                                                                                                                                                                                                                           | https://en.wikipedia.org/wiki/User:Hanz24                               |
| User:Hanzo2050                            | En wikipedia: User: Hanzo2050                                                                                                                                                                                                                                                                                                                                                                                                                          | https://en.wikipedia.org/wiki/User:Hanzo2050                            |
| User talk:Hanzov69                        |                                                                                                                                                                                                                                                                                                                                                                                                                                                        | https://en.wikipedia.org/wiki/User_talk:Hanzov69                        |
| User talk:Hanzon                          | --                                                                                                                                                                                                                                                                                                                                                                                                                                                     | https://en.wikipedia.org/wiki/User_talk:Hanzon                          |
| User talk:Hanzo2050                       |                                                                                                                                                                                                                                                                                                                                                                                                                                                        | https://en.wikipedia.org/wiki/User_talk:Hanzo2050                       |
| User talk:Hanznolo                        |                                                                                                                                                                                                                                                                                                                                                                                                                                                        | https://en.wikipedia.org/wiki/User_talk:Hanznolo                        |
| User talk:Hanzze                          |                                                                                                                                                                                                                                                                                                                                                                                                                                                        | https://en.wikipedia.org/wiki/User_talk:Hanzze                          |
